CREATE OR REPLACE FUNCTION CARD_BACK.F_RANGE_IS_ILLEGAL (V_MIN INTEGER, V_MAX INTEGER)
RETURN VARCHAR2 
IS
F VARCHAR2(500);   

/*
Если функция вернула значение = пустая строка (в Оракл это IS NULL) - то всё нормально, тревоги нет
Иначе = Имеются карты полученые незаконно и должны быть на складе а не у клиента!
*/

N_COUNT INTEGER; ---- Число КЭО в указанном пользователем диапазоне


BEGIN

F := '';

N_COUNT := 0;

/*=======================================================================================*/

-------------------------------------------------------------------------------------------------------
SELECT 
    COUNT(*)   
INTO
    N_COUNT ---- Число пересечений с диапазонами КЭО которые находятся на складе
FROM 
TD_RANGE_WAREHOUSE 
WHERE  CARD_BACK.F_INTERSECTION(V_MIN, V_MAX, ICC_START, ICC_END) > 0; 
-------------------------------------------------------------------------------------------------------

/*=======================================================================================*/
    

IF N_COUNT > 0 THEN ---- Тревога! У клиента есть КЭО которых у него быть не должно!
    F := ' Внимание! В диапазоне есть карты, которые должны быть на складе! Информируйте ДБ. ';
END IF;

/*=======================================================================================*/


RETURN(F);

EXCEPTION 
    WHEN OTHERS THEN 
           RETURN('');
     
END;